{  
   "status":1,
   "info":[  
      {  
         "loc_name":"College  of Arts and Sciences",
         "loc_history":"The College of Arts and Sciences became 45 years old on June 2010. Established as a service college on 1965 with the elevation of the former Mindanao Agricultural College (MAC) to Central Mindanao University (CMU) by virtue to RA 4498, the college started with only two departments: Humanities and the Natural Sciences, each one having two or more divisions. In the 1980’s up to the present, CAS metamorphosed into Physics, Mathematics, Social Sciences, Behavioural Sciences, Language and literature, Biology and Chemistry from two degree programs in 1971- Bachelor of Arts major in English and Bachelor of Liberal Studies- the college now offers nine undergraduate degree programs (AB English, AB Psychology, AB Sociology, AB History, BS Biology, BS Chemistry, and BS Mathematics), four Master’s Degree Programs (MA Anthropology, MA English, MA Mathematics, and MS Biology). Along with the increase in the degree programs is the change of the CAS building from basically a one-storey building in 1965 to a three-storey building in 1980.In 2005, a new two-storey building was added and in 2009, another one-storey building with five classroom conducive for learning to the infrastructure of the CAS. There are men and women, who have graduated from the college and who are now responsible and productive members of the society, are but indicators that the college has done its share to make CMU achieve its mission, vision, goals, and objectives.",
         "loc_goals":"The College of Arts and Sciences shall service other colleges by offering general education courses that will enable future professionals to effectively function in society; produce graduates with competencies in the natural, physical, social and behavioral sciences as well as in the Arts, imbued with humanistic and ethical values and with a clear understanding of their Filipino heritage; develop manpower to promote quality research, extension and production activities for sustainable development and environment conservation; and establish linkages with academic, government, and other agencies to uplift the quality of life in the region.",
         "loc_objectives":"To provide quality, humanistic and scientific education and training to undergraduate and graduate students of the college so as to enable them to live effectively in a changing human society. To develop an analytical and searching mind as well as certain level of skills that can serve the needs of mankind for a better world of tomorrow. To graduate individuals imbued with environmental consciousness, endowed with humility in greatness, compassion for their fellowmen and above all, love of country. To strengthen the faculty members of the college through its Faculty Development Program. To improve, renovate the existing classrooms, laboratories and audiovisual hall of the college as well as to build additional building of the college to cater to the increasing enrolment of students per year. To acquire latest equipment and facilities to allow the students to have hands on experience as part of their training. To develop research and extension capabilities of the college in line with th",
         "loc_courses_offered":"College of Arts and Sciences Courses Offered:\r\n\r\nBachelor of Arts in English\r\nBachelor of Arts in History\r\nBachelor of Arts in Library Science ( Under Moratorium)\r\nBachelor of Arts in Political Science\r\nBachelor of Arts in Psychology\r\nBachelor of Arts in Sociology\r\nBachelor of Science in Biology\r\nBachelor of Science in Chemistry\r\nBachelor of Science in Mathematics\r\nBachelor of Science in Physics",
         "loc_directory":""
      }
   ]
}