{  
   "status":1,
   "info":[  
      {  
         "loc_name":"College of Agriculture",
         "loc_history":"        The College of Agriculture is the premier college of Central Mindanao University. It has its origin in Mailag, Malaybalay, Bukidnon as the Mailag Industrial School (MIS) in 1910 as one of the settlement farm schools organized by the Americans. It offered only the first four grades of the elementary agriculture curriculum. The school was opened largely to address the necessity of training Bukidnon to teach in their own province since it is difficult to hire non-Bukidnon teachers to serve in newly-opened public schools.\r\n\r\n       It underwent seven name changes to fully reflect its aspirations and stay dynamic as an academic institution. It became Bukidnon Agricultural School (BAS) and was transferred to Managok, Malaybalay, Bukidnon in 1921. In 1923, it became Bukidnon Rural High School (BRHS) and in 1928, it was renamed the Bukidnon Agricultural High School (BAHS). In 1938, it became Bukidnon National Agricultural School (BNAS). Its operations were stopped due to the outbreak of war in 1944. However, in 1946, BNAS was re-opened and its present site in Musuan, Maramag, Bukidnon.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                ",
         "loc_goals":"As a Center of Excellence in Agriculture Education, the CMU-CA has the following goals to achieve:\r\nExcellent and relevant instruction in the undergraduate degree programs;\r\nQuality and relevant researches for sustainable agricultural development;\r\nPromotion of appropriate technology for improved quality of life; and\r\nDevelopment of highly trained human resources for agricultural entrepreneurship.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    ",
         "loc_objectives":"The CMU-CA has the following objectives:\r\nTo offer excellent and relevant baccalaureate degree programs in agriculture, agribusiness management and development communication;\r\nTo produce quality instructional materials relevant to its various degree programs;\r\nTo inculcate moral values for total human development;\r\nTo produce quality researches relevant to institutional, regional and national development goals;\r\nTo package generated agricultural technologies for its various stakeholders;\r\nTo promote relevant agricultural technologies for improved quality of life; and\r\nTo produce quality graduates for agricultural entrepreneurship.                                                                                                                                                                                                                                                                                                                                                                          ",
         "loc_courses_offered":"Bachelor of Science in Agriculture Major in:\r\nAgronomy\r\nAnimal Science\r\nEntomology\r\nHorticulture\r\nPlant Breeding\r\nPlant Pathology\r\nSoil Science\r\nAgricultural Economics\r\nAgricultural Education: (Elementary & High School Option)\r\nAgricultural Extension\r\nBachelor of Science in Agribusiness Management Major in:\r\nCrop Enterprise Livestock Enterprise\r\nBachelor of Science in Development Communication                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            ",
         "loc_directory":"Email:  ca_cmu1910@yahoo.com\r\nContact Number:  1                                                                                                                                                                                                                                                            "
      }
   ]
}