{  
   "status":1,
   "info":[  
      {  
         "loc_name":"College of Engineering",
         "loc_history":"The College of Engineering is an outgrowth of an agricultural engineering department, formerly of the Mindanao Agricultural College (MAC). It was on July 17, 1959 that the Board of Trustees of MAC approved the offering of a five-year course leading to the degree of Bachelor of Science in Agricultural Engineering (BSAE). Due to the significant increase in enrolment, the department was converted into a college by virtue of a Board Resolution No. 2 series of 1965 as approved by the Board of Regents of Central Mindanao University.\r\n\r\nFrom  that time until 1970, the college has a single curricular offering which is the five-year curriculum leading the degree of Bachelor of Science in Agricultural Engineering > However in June 1970, a course lading to the degree of Bachelor  of Science in Civil Engineering was offered. The College was then composed of the two courses BSAE and BSCE.\r\n\r\nIn 1975, two more departments were created: the department of Mechanical Engineering and Electrical Engineering. These two new departments served only as service departments that took care of the mechanical engineering and electrical engineering courses of AE and CE degree programs. In June 1984, the Bachelor of Science in Mechanical Engineering (BSME) and Bachelor of Science in Electrical Engineering (BSEE) were offered. In 2005, the Institute of Computer Application was created offering Bachelor of Science in Information Technology.\r\n\r\nAt present, the college is composed of five degree-awarding departments: the AE department, CE department, ME department, EE department and IT department.\r\n\r\nThe College of Engineering also houses the CMU Computer Center that serves the computer laboratory classes of all the computer courses offered by the various colleges of the University. Moreover, the Computer Center also has been offering computer literacy training to CMU students, faculty members and administrative staff.",
         "loc_goals":"College Goals\r\n\r\nThe College of Engineering envisions to become a Center of Excellence in Sustainable Engineering and Agro-Industrial Technology Education in Mindanao. The college has the following goals:\r\n\r\nThe provision of excellent baccalaureate and post-baccalaureate engineering degree and non-degree programs and related fields;\r\nThe generation of new knowledge and technologies by conducting basic and applied agro-industrial researches; and\r\nThe development, evaluation, packaging and dissemination of mature engineering technologies and information systems in order to accelerate agro-industrial development in Mindanao in particular and the Philippines in general.",
         "loc_objectives":"                                            ",
         "loc_courses_offered":"Courses Offered:\r\n\r\nBachelor of Science in Agricultural Engineering\r\nBachelor of Science in Civil Engineering\r\nBachelor of Science in Electrical Engineering\r\nBachelor of Science in Information Technology\r\nBachelor of Science in Mechanical Engineering",
         "loc_directory":"                                            "
      }
   ]
}