{  
   "status":1,
   "info":[  
      {  
         "loc_name":"College of Education",
         "loc_history":"June 19, 1965- RA 4498 converted Mindanao Agricultural College to Central Mindanao University BOR No. 2, s. 1965 converted the Department of Agricultural Education to College of Education.\r\n\r\nIn 1970, the CMU BOR approved the course offerings, Bachelor of Science in Education major English, Mathematics and Physics, and of the Agricultural Education offering in the College of Education. The BSA-AgEd course offering is at present at the College of Agriculture.\r\n\r\nIn 1972, the integration of the Public Elementary School at Musuan into the University. This gave birth to the CMU Elementary Laboratory School.\r\n\r\nIn 1975, the Board of Regents approved the initial absorption of the Bureau of Public School Teachers into the University Plantilla. Total integration then followed. In 1977, the approval of two new curricular offerings namely: Bachelor of Science in Business Education (BSBE) and Certificate of Secretarial Science. In 1982, the offering of the one-year clerical course was approved and in June 1987, the CMU Elementary Laboratory High School was turned over to the Department of Education, Culture and Sports (DECS), now known as Musuan Elementary School.\r\n\r\nIn 1989 BOR resolution no. 95, s. 1989 approved the implementation of the Certificate of Teaching, a one-year program for non-education graduates who desire to teach. CT (elementary option) has been phased out. In 1993, BOR resolution no. 66, s. 1993 approved the resumption of the general Secondary Academic Curriculum and in 1996 the two-year Secretarial Science course was phase out. In 1997 to 1998 the implementation of the BSE degree major in Physical Education was realized.\r\n\r\nIn 2002, BSOA curriculum was approved by the University Academic Council and in 2003, the curriculum was approved for implementation by virtue of the BOR resolution no. 11, s. 2003 dated march 17, 2003.\r\n\r\nIn 2009, the department of Business Education was transferred to the College of Commerce and Accountancy.\r\n\r\nPresently, the College of",
         "loc_goals":"College Mission\r\n\r\nThe College is committed to pursue excellence in instruction, research, community service and production in:\r\n\r\nTeacher education and educational management, that are development oriented; and\r\nPhysical education, physical fitness and sports.\r\nCollege Goals\r\n\r\nTo produce teachers who can effectively carry out programs and generate effective services in the secondary and tertiary levels and who are imbued with basic attitudes, knowledge and skills essential for personal and social fulfillment, as well as attainment of national goals;\r\nTo provide professional training in teaching in the secondary and tertiary levels to non-education baccalaureate degree graduates;\r\nTo provide training to graduate students who aim to develop professional competence in their field of specialization through advanced studies and research;\r\nTo upgrade the competencies of teachers and para-professionals through in-service trainings;\r\nTo produce teachers equipped with educational theories and",
         "loc_objectives":"",
         "loc_courses_offered":"Bachelor of Science in Education\r\n\r\nMajor in:\r\n\r\nBiology\r\nEnglish\r\nFilipino\r\nGeneral Science\r\nMathematics\r\nPhysical Education\r\nPhysics\r\nCertificate in Teaching\r\nGraduate Programs\r\nAdministration and Supervision\r\nBiology Education\r\nEducational Administration\r\nGeneral Science Education\r\nMathematics Education",
         "loc_directory":"Email: educsecretary@cmu.edu.ph"
      }
   ]
}